In [1]:
import pandas as pd
import requests
import numpy as np

In [2]:
# create a simple series
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])
s

a    3
b   -5
c    7
d    4
dtype: int64

In [3]:
# create a two-dimensional data structure
data = {'Country': ['Belgium', 'India', 'Brazil'],
        'Capital': ['Brussels', 'New Delhi', 'Brasilia'],
        'Population': [11190846, 1303171035, 207847528]}

census = pd.DataFrame(data,columns=['Country', 'Capital', 'Population'])
census.head()

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasilia   207847528

In [4]:
# get a subset
census[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasilia   207847528

In [5]:
# filtering
census[census['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [6]:
# sort by values
census.sort_values(by='Country')

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasilia   207847528
1    India  New Delhi  1303171035

In [7]:
# rank things
census.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

In [8]:
# get some information about your dataframe
census.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
Country       3 non-null object
Capital       3 non-null object
Population    3 non-null int64
dtypes: int64(1), object(2)
memory usage: 152.0+ bytes

In [9]:
# get the min or max
census.min()
#df.max()

Country        Belgium
Capital       Brasilia
Population    11190846
dtype: object

In [10]:
# summary stats
census.describe()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [11]:
# Get the dataset metadata by passing package_id to the package_search endpoint
url = "https://ckan0.cf.opendata.inter.prod-toronto.ca/api/3/action/package_show"
params = { "id": "99ff3657-b2e7-4005-a6fd-c36838ccc96d"}
package = requests.get(url, params = params).json()
# print(package["result"])

In [12]:
# Get the data by passing the resource_id to the datastore_search endpoint
for idx, resource in enumerate(package["result"]["resources"]):
    if resource["datastore_active"]:
        url = "https://ckan0.cf.opendata.inter.prod-toronto.ca/api/3/action/datastore_search"
        p = { "id": resource["id"] }
        data = requests.get(url, params = p).json()
        df = pd.DataFrame(data["result"]["records"])
        break

In [13]:
df.head()

,DTP Religious exemption rate (%),DTP coverage rate (%),Enrolled population,Lat,Lng,MMR Religious exemption rate (%),MMR coverage rate (%),School Name,_id
0,1.0,91.0,1070,43.805261,-79.366555,1.0,95.7,A Y JACKSON SECONDARY SCHOOL,1
1,1.8,88.2,110,43.762419,-79.179765,1.8,90.0,ACADEMIE ALEXANDRE-DUMAS,2
2,3.6,91.9,247,43.683152,-79.288488,3.6,94.3,ADAM BECK JUNIOR PUBLIC SCHOOL,3
3,19.7,71.2,66,43.745424,-79.488261,19.7,72.7,AFRICENTRIC ALTERNATIVE SCHOOL,4
4,1.0,90.7,1253,43.788874,-79.278910,1.0,97.8,AGINCOURT COLLEGIATE INSTITUTE,5

## For everything else, use a cheatsheet: 
https://pandas.pydata.org/Pandas_Cheat_Sheet.pdf